# LoadCaseId Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
LoadBase..::..LoadCaseId Property
LoadBase Class See Also
---
The load case ID for the load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ElementId LoadCaseId { get; set; }
```

Visual Basic
---
```text
Public Property LoadCaseId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ LoadCaseId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace